Autodesk.Revit.DB.IFC.IFCProductWrapper.AddAnnotation(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCLevelInfo,System.Boolean)
Adds an annotation handle to associate with the IfcProduct in this wrapper.
annoHnd:
The annotation handle.
levelInfo:
Information on the associated level.  Optional, can be null.
relateToLevel:
True to relate the annotation to the level, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.IFCProductWrapper.AddElement(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCLevelInfo,Autodesk.Revit.DB.IFC.IFCExtrusionCreationData,System.Boolean)
Adds an IfcElement handle to associate with the IfcProduct in this wrapper.
elementHandle:
The IfcElement handle.
pLevelInfo:
The level info.
params:
The extrusion creation data associated with the given element.  Optional, can be null.
relateToLevel:
True to relate the element to the level, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCProductWrapper.AddSpace(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCLevelInfo,Autodesk.Revit.DB.IFC.IFCExtrusionCreationData,System.Boolean)
Adds an IfcSpace handle to associate with the IfcProduct in this wrapper.
spaceHandle:
The IfcSpace handle.
pLevelInfo:
Information on the associated level.
pParams:
The extrusion creation data associated with the given space.  Optional, can be null.
relateToLevel:
True to relate the space to the level, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012